[
    {
        "id": "5hoJ9417vkflwHGEq0avLw",
        "slug": "changelog\/requirements\/change-log\/2024-12-18",
        "linkBack": "changelog\/requirements",
        "changelogType": "Services",
        "changelogDate": "2024-12-18T00:00",
        "summary": "App Marketplace Requirements, new and updated requirements",
        "details": "The App Marketplace requirements appear in developer documentation ([App Marketplace API Usage Requirements](app-marketplace\/requirements)) and in the Developer Console. In most cases, requirement questions and resulting requirements appear in both places. Otherwise, they appear in the Developer Console only.\n\n## Documentation and Developer Console\nThe following requirements are added or updated in the documentation and the Developer Console:\n\n### Team API\n* **New requirement** - \"Your app assigns a job to all team members it creates in Square.\"\n* **Updated requirement:**\n * **Original requirement** - \"Your app can sync updated employee details (such as name or email) to Square.\"\n * **New requirement** - \"Your app can sync updated employee details (such as name, email, or wage settings) to Square.\"\n* **Updated requirement:**\n * **Original requirement** - \"Your app can sync updated team member details (such as name or email) from Square.\"\n * **New requirement** - \"Your app can sync updated team member details (such as name, email, or wage settings) from Square.\"\n* **Removed requirement** - \"Your app can sync updated wage settings from Square.\".\n### Payments API\n* **Updated question** - \"Select the payment solutions present in your app.\"\n * **New option** - \"Mobile Payments SDK\" \n* **New requirement** - \"Your app requests sufficient privacy\/device permissions when using the Mobile Payments SDK.\"\n* **New requirement** - \"Your app prompts the seller to select a location when using the Mobile Payments SDK.\"\n* **New requirement** - \"Your app only attempts to authorize the Mobile Payments SDK on devices that don’t already have a valid authorization.\"\n* **New requirement** - \"Your app can successfully pair a Square Reader.\"\n* **New requirement** - \"Your app provides a way for the seller to check the Square Reader's current connection status.\"\n* **New requirement** - \"Your app can successfully forget a previously paired Square Reader.\"\n* **New requirement** - \"Your app deauthorizes the Mobile Payments SDK when a user logs out of your app or hasn’t had any activity in the app within 4 hours.\"\n* **New requirement** - \"Your app successfully takes a card-present payment using the Mobile Payments SDK.\"\n* **New requirement** - \"Your payment solution is only intended for use in kiosks or terminals that are attended by the seller's team.\"\n* **New requirement** - \"Your app handles declined Mobile Payments SDK payments.\"\n* **New requirement** - \"Your app provides buyers with the option to receive a digital or printed receipt.\"\n* **New requirement** - \"Your app provides buyers who opt-in with a digital or printed receipt.\"\n* **New requirement** - \"Your app runs the Mobile Payments SDK exclusively on currently supported devices. If a seller tries to run the app on an unsupported device, your app displays a user-friendly error. \"\n* **New question** - \"Does your app accept manual keyed entry credit card payments with the Mobile Payments SDK?\"\n* **New requirement** - \"Your app successfully takes a payment from a manually keyed card entry using the Mobile Payments SDK.\" \n* **New question** - \"Does your app support taking offline payments using the Mobile Payments SDK?\"\n* **New requirement** - \"Your app successfully takes a payment offline.\" \n* **New requirement** - \"When reconnected, your app retrieves successful and failed offline transactions.\" \n* **New requirement** - \"Your app notifies sellers about any queued offline transactions before deauthorizing.\" \n* **New requirement** - \"Your app provides proper documentation and in-app alerts to notify sellers when offline.\" \n\n### Developer console\n* **New question** - \"Confirm that your app runs the Mobile Payments SDK exclusively on currently supported devices. If a seller tries to run the app on an unsupported device, your app displays a user-friendly error. \"\n* **New question** - \"Confirm that your payment solution is only intended for use in kiosks or terminals that are attended by the seller's team.\"\n",
        "tags": [
            "Team API",
            "Payments API"
        ]
    },
    {
        "id": "7eP8zzySbqZfzYQ6yEdFyY",
        "slug": "changelog\/requirements\/change-log\/2024-11-20",
        "linkBack": "changelog\/requirements",
        "changelogType": "Services",
        "changelogDate": "2024-11-20T00:00",
        "summary": "App Marketplace Requirements, new and updated requirements",
        "details": "The App Marketplace requirements appear in developer documentation ([App Marketplace API Usage Requirements](app-marketplace\/requirements)) and in the Developer Console. In most cases, requirement questions and resulting requirements appear in both places. Otherwise, they appear in the Developer Console only.\n\n## Documentation and Developer Console\nThe following requirements are added or updated in the documentation and the Developer Console:\n\n### Team API\n* **New question** - \"Are team member syncs bi-directional or one way?\" \n* **New requirement** - \"Your app can sync new employees (team members) to Square.\"\n* **New requirement** - \"Your app can sync updated employee details (such as name or email) to Square.\"\n* **New requirement** - \"Your app can sync active employees (team members) from Square.\"\n* **New requirement** - \"Your app can sync updated team member details (such as name or email) from Square.\"\n* **New requirement** - \"Your app can sync updated wage settings from Square.\"\n\n### Inventory API\n* **New question - Requirements Documentation** - \"Does your app use the Inventory API?\"\n* **New Inventory API requirement** - \"When an item is sold in Square, your app syncs the stock update to your platform.\"\n* **New Inventory API requirement** - \"When item stock is manually updated in Square, your app syncs the update to your platform.\"\n* **New Inventory API requirement** - \"When an item is sold on your platform, your app syncs the stock update to Square.\"\n* **New Inventory API requirement** - \"When item stock is manually updated on your platform, your app syncs the update to Square.\"\n* **New Inventory API requirement** - \"Your app accurately syncs item stock counts from Square after the initial integration connection.\"",
        "tags": [
            "Payments API",
            "Inventory API"
        ]
    },
    {
        "id": "3Hs81tTBDHJkhgLRgSVnP8",
        "slug": "changelog\/requirements\/change-log\/2024-09-19",
        "linkBack": "changelog\/requirements",
        "changelogType": "Services",
        "changelogDate": "2024-09-19T00:00",
        "summary": "App Marketplace Requirements, new and updated requirements",
        "details": "The App Marketplace requirements appear in developer documentation ([App Marketplace API Usage Requirements](app-marketplace\/requirements)) and in the Developer Console. In most cases, requirement questions and resulting requirements appear in both places. Otherwise, they appear in the Developer Console only.\n\n## Documentation and Developer Console\nThe following requirements are added or updated in the documentation and the Developer Console:\n\n### Payments API\n* **New question** - \"Does your app create or update payments in Square?\" \n* **Moved question** - \"Does your app process payments in the European Economic Area (EEA), including the UK?\" This question only appears if your app creates or updates payments in Square.\n* **Moved question** - \"Select the payment solutions present in your app.\" This question only appears if your app creates or updates payments in Square. \n* **Moved question** - \"Do you use delayed capture when processing payments with the Payments API?\" This question only appears if your app creates or updates payments in Square.\n* **Moved question** - \"Do you collect app fees on payments?\" This question only appears if your app creates or updates payments in Square.\n* **Moved question** - \"Do you use the Refunds API?\" This question only appears if your app creates or updates payments in Square.\n* **Moved question** - \"Do you process external payments with the Payments API?\" This question only appears if your app creates or updates payments in Square.\n* **Moved requirement** - \"The country\/currency code is set to the Square account's currency code.\" This requirement only appears if your app creates or updates payments in Square.\n* **Moved requirement** - \"Your app successfully creates a transaction.\" This requirement only appears if your app creates or updates payments in Square.\n* **Moved requirement** - \"The partner name and a unique human-readable transaction ID and\/or invoice ID are provided in the `note` parameter.\" This requirement only appears if your app creates or updates payments in Square.\n* **Moved requirement** - \"When a payment fails or a buyer navigates away from your site, your app ensures that there are no orphaned orders.\" This requirement only appears if your app creates or updates payments in Square.\n* **Moved requirement** - \"When known, your app supplies a Square `customer_id` to `CreatePayment` requests.\" This requirement only appears if your app creates or updates payments in Square.\n* **Updated requirement:**\n * **Original requirement** - \"Location names in your Square account are descriptive and representative of your business.\"\n * **New requirement** - \"The Business Name in your Square account is descriptive and representative of your business. (By default, your Business Name is ‘MyBusiness’ if you don't explicitly set it.)\"\n* **New requirement** - \"Your app periodically syncs Square refunds to your application.\"\n\n### Terminal API\n* **New requirement** - \"Location names in your Square account are descriptive and representative of your business.\" This requirement is for applications that collect fees on payments made with Square Terminal.",
        "tags": [
            "App Marketplace Requirements",
            "Payments API",
            "Terminal API"
        ]
    },
    {
        "id": "3Gn2fJ8tHqBuDVV3708rzl",
        "slug": "changelog\/requirements\/change-log\/2024-08-23",
        "linkBack": "changelog\/requirements",
        "changelogType": "Services",
        "changelogDate": "2024-08-23T00:00",
        "summary": "App Marketplace Requirements, new and updated requirements",
        "details": "The App Marketplace requirements appear in developer documentation ([App Marketplace API Usage Requirements](app-marketplace\/requirements)) and in the Developer Console. In most cases, requirement questions and resulting requirements appear in both places. Otherwise, they appear in the Developer Console only.\n\n## Developer Console only\nThe following requirements are added or updated in the Developer Console:\n\n### General\n* **New question** - \"In 1-2 sentences, describe what your integration does and how it benefits Square sellers.\"\n* **New question** - \"App Usage Instructions: Square reviewers will test your app as if they're real Square sellers. Provide instructions for how to use your integration after onboarding onto your app by including links to relevant guides.\"\n* **New question** - \"Confirm that your app uses exponential backoff to manage rate-limit errors.\"\n* **Updated question:** \n * **Original question** - \"Is there any additional setup required by the seller after the OAuth flow and data import (if applicable) and prior to using the integration?\"\n * **New question** - \"Is there any additional setup required by the seller in your app after connecting their Square account (via OAuth)?\" \n* **Updated question:** \n * **Original question** - \"Onboarding\/App Instructions: Use this space to provide any additional instructions for onboarding or app use, such as links to documentation or setup guides.\"\n * **New question** - \"Onboarding Instructions: Provide instructions for onboarding onto your app. Include links to relevant setup guides, or create a document with instructions and share the link here.\"\n\n### OAuth API\n * **New question** - \"Confirm that Square access tokens are AES-encrypted in your database.\"\n * **New question** - \"Confirm that your AES encryption key isn't stored in source control and separate keys are used for staging and production.\"\n * **New question** - \"Confirm that your Square OAuth secret isn't stored in source control.\"\n\n## Documentation and Developer Console\nThe following requirements are added or updated in the documentation and the Developer Console:\n\n### App Subscriptions\n * Updated labels and titles from \"App Subscriptions API\" to \"App Subscriptions\" to correct misleading information. App subscriptions are enabled by use of the Subscriptions API, not an App Subscriptions API.\n\n### Customers API\n* **New question** - \"Does your app import customer data from Square?\"\n* **New requirement** - \"Upon initial sync, customer data is imported accurately into your app.\" This requirement only appears if your app imports customer data from Square.\n* **Moved question** - \"Do you update customers in your app when customers are updated in Square?\" This question only appears if your app imports customer data from Square.\n* **Updated question:** \n * **Original question** - \"Does your app create or update customer data?\"\n * **New question** - \"Does your app create or update customer data in Square?\"\n\n### General\n * **New requirement** - \"Your app can paginate through API results using the `cursor` field.\"\n\n### Labor API\n * Requirements for the [Labor API](app-marketplace\/requirements\/labor-api) (initial publication). \n\n### Locations API\n* **Updated question:** \n * **Original question** - \"How does your app connect the seller's desired Square locations?\nA seller selects their locations from a field in the user interface.\"\n * **New question** - \"How does your app connect the seller's desired Square locations?\nA seller selects their locations from a field in the user interface. (Recommended)\"\n\n### OAuth API\n* **New question** - \"Confirm that your app has implemented logic to refresh OAuth tokens asynchronously every 7-14 days.\" \n* **Removed requirement** - \"The `session` parameter is set to `false`.\"\n* **Updated question answer** - \"Do you provide a mechanism for sellers to revoke OAuth access from within your app?\"\n * **Original answer** - \"Yes No\"\"\n * **New answer** - \"Yes **(Recommended)**\nNo\"\"\n* **Updated question answer** - \"Do you use hosted or on-premise OAuth?\"\n * **Original Answer** - \"Hosted On-Premise\"\n * **New answer** - \"Hosted (Recommended) On-Premise\"\n\n### Orders API\n* **New requirement** - \"Your app deducts refunds to accurately display daily sales amounts.\" - This requirement is for applications that show any order sales data that belongs to Square sellers, including order items, prices, taxes, or fulfillment states. \n\n### Payments API\n* **New requirement** - \"Location names in your Square account are descriptive and representative of your business.\" This requirement is for applications that collect app fees on payments.\n\n### Terminal API\n* **New requirement** - \"Location names in your Square account are descriptive and representative of your business.\" This requirement is for applications that collect fees on payments made with Square Terminal.",
        "tags": [
            "App Marketplace Requirements",
            "Customers API",
            "Labor API",
            "Locations API",
            "OAuth API",
            "Orders API",
            "Payments API",
            "Terminal API"
        ]
    },
    {
        "id": "7JK7RJUu4FvrGK01Yf3X3X",
        "slug": "changelog\/requirements\/change-log\/2024-06-24",
        "linkBack": "changelog\/requirements",
        "changelogType": "Services",
        "changelogDate": "2024-06-24T00:00",
        "summary": "App Marketplace Requirements for App Subscriptions, initial release",
        "details": "### New requirements\n\n* **App Subscriptions**\n * Requirements for [App Subscriptions](app-marketplace\/app-subscriptions) added to the existing set of App Marketplace API usage requirements. \n",
        "tags": [
            "App Marketplace Requirements"
        ]
    },
    {
        "id": "4XESY9M6JhgmsGq3sSFZLf",
        "slug": "changelog\/requirements\/change-log\/2024-03-22",
        "linkBack": "changelog\/requirements",
        "changelogType": "Services",
        "changelogDate": "2024-03-22T00:00",
        "summary": "App Marketplace Requirements for App Subscriptions, updated requirements",
        "details": "The App Marketplace requirements appear in developer documentation ([App Marketplace Requirements](\/app-marketplace\/requirements)) and in the Developer Console. In most cases, requirement questions and resulting requirements appear in both places. Otherwise, they appear in the Developer Console only.\n\n## Updated requirements\n\n### Developer Console\nThe following requirements are added or updated in the Developer Console:\n\n* **Bookings API**\n * \"Describe how you use booking custom attributes.\", updated answer type\n * \"Do you sync all services or is there a service onboarding experience?\", updated options\n * \"Do you create your own services using the Catalog API?\"\n * \"Do you provide a mechanism to sync new services added in Square?\"\n * \"Do you sync bookings across all Square locations or just one? What is the mapping?\"\n * \"Are syncs asynchronous?\"\n * \"If changes are made to a service in the partner platform, and the merchant re-syncs their appointments, what happens to the service in Square?\"\n * \"If changes are made to a service in Square, and the merchant re-syncs their catalog, what happens to the service in the partner platform?\"\n* **Catalog API**\n * \"Which platform is considered the 'System of Record' for catalog updates?\", updated answer options\n * \"If your app provides a setting for the seller to pull items, what level is set?\", updated answer options\n * \"Does your app initiate a sync immediately when connecting to a seller's account using OAuth? If not, how does the initial sync occur?\", clarified question\n * \"Does your app provide a mechanism to initiate a sync?\", clarified question\n * \"How does your app handle items that aren't available at specific locations?\", clarified question\n * \"If changes are made to a product in Square and the merchant initiates another catalog sync, what happens to the product in your app's platform?\", clarified question\n * \"If changes are made to a product in your app's platform, and the merchant resyncs their item catalog, what happens to products in the Square catalog?\", clarified question\n * \"Are catalog syncs asynchronous?\"\n * \"What is the time interval between polls or syncs? Is the interval preset or can a seller choose the interval?\"\n * \"Are catalog syncs asynchronous?\"\n * \"Please describe how you use catalog custom attributes.\"\n * \"If inventory changes are manually made to a product in Square, what happens to the inventory in the your platform?\"\n * \"If an item is sold in Square, what happens to the item's inventory in the your platform?\"\n * \"If inventory changes are manually made to a product in your platform, what happens to the inventory in Square?\"\n * \"If an item is sold in your platform, what happens to the item's inventory in Square?\"\n * \"Which platform is considered the 'System of Record' for inventory updates?\"\n * \"Does your app use the Inventory API?\"\n* **Customers API**\n * \"Please describe how you use customer custom attributes.\"\n* **Locations API**\n * \"Please describe how you use location custom attributes.\"\n* **Terminal API**\n * \"What separate_tip_screen setting does your app use?\", updated answer choices\n\n#### Documentation\nThe following requirements are added or updated in the documentation and the Developer Console:\n\n* **Bookings API**\n * \"Do you use the Booking Custom Attributes API?\"\n* **Catalog API**\n * \"Does your app use the Catalog Custom Attributes API?\"\n* **Customers API**\n * \"Do you use the Card on File feature along with the Customers API?\"\n * \"Does your app use the Customer Custom Attributes API?\"\n * \"Do you use the Customer Segments API?\"\n* **Locations API**\n * \"Does your app use the Location Custom Attributes API?\" \n",
        "tags": [
            "App Marketplace Requirements",
            "Bookings API",
            "Catalog API",
            "Customers API",
            "Locations API",
            "Terminal API"
        ]
    },
    {
        "id": "22zSOBbqRg55WcatBVxh3G",
        "slug": "changelog\/requirements\/change-log\/2023-12-13",
        "linkBack": "changelog\/requirements",
        "changelogType": "Services",
        "changelogDate": "2023-12-13T00:00",
        "summary": "Initial release of the Square API Requirements checklists",
        "details": "### Initial requirements release\n\n* **App Marketplace Requirements:**\n\n The App Marketplace requirements list shows you the set of requirements that Square will verify your application against before publishing it in the App Marketplace. The set of requirements that your application is verified against depends on which APIs you use. For more information, see [App Marketplace API Usage Requirements](app-marketplace\/requirements). ",
        "tags": [
            "App Marketplace Requirements"
        ]
    }
]